{
  "header": {
    "home": "Home",
    "about": "About",
    "portfolio": "Portfolio",
    "contact": "Contact Me"
  },
  "sections": {
    "home": {
      "title": "Hi, I'm Julio",
      "subtitle": "How can I help you?"
    },
    "about": {
      "title": "About me",
      "text1": "I am a Junior developer, who has developed applications for various companies and is seeking new opportunities. I have experience with web design, working in a team and solving problems.",
      "text2": "Currently, I have been sharing my knowledge through articles, with published texts about programming and personal development. I am also deepening my knowledge in ReactJS and Typescript.",
      "link": "Read my articles",
      "alt": "My photo (creator of this website)"
    },
    "portfolio": {
      "title": "Portfolio",
      "subtitle": "Working as an intern and front-end developer, I worked on several projects for different companies. Here is the list below.",
      "description": {
        "courses": {
          "text1": "Online courses and video lessons website, including a blog with posts from students, entirely made in Javascript.",
          "text2": "The application provided students with easy access to content and a harmonious interface."
        },
        "smart-monitor": {
          "text1": "Real-time factory machinery management application.",
          "text2": "It facilitates the manager's management and inspection of the machines, offering production statistics."
        },
        "landing": {
          "text1": "Page with questionnaire and purchase sections made in Material UI and using Typeform for forms.",
          "text2": "The application is an excellent presentation of the company, and its questionnaires provide insights for those who fill them out."
        },
        "ecommerce": {
          "text1": "Custom e-commerce website with payment, delivery, and reports sections, made using Typescript and React Hook Forms.",
          "text2": "The project helped automate several previously manual processes."
        },
        "quiz": {
          "text1": "Workplace safety quiz with CRUD of questions and answers.",
          "text2": "The questionnaire contributed to ensuring employees' understanding of safety."
        },
        "custom-crud": {
          "text1": "Package for automating the creation of CRUDs, with tables and forms, using Material UI.",
          "text2": "The package speeds up the creation of new CRUDs and allows high customization."
        }
      },
      "visit": "Visit website"
    },
    "contact": {
      "title": "Contact Me",
      "subtitle": "Fill in the fields below to get in contact",
      "fields": {
        "name": {
          "label": "Name",
          "placeholder": "Write your name",
          "errors": {
            "required": "Name is mandatory"
          }
        },
        "email": {
          "label": "E-mail",
          "placeholder": "email@example.com",
          "errors": {
            "email": "E-mail must be a valid email address",
            "required": "E-mail is mandatory"
          }
        },
        "subject": {
          "label": "Subject",
          "placeholder": "Write the subject here",
          "errors": {
            "required": "Subject is mandatory"
          }
        },
        "message": {
          "label": "Message",
          "placeholder": "Write your message here",
          "errors": {
            "required": "Message is mandatory"
          }
        }
      },
      "subjects": {
        "email": "Hello%21",
        "number": "Hello+Julio%21"
      },
      "button": "Send Message",
      "messages": {
        "success": "Email successfully sent",
        "wrong": "Error sending email"
      }
    }
  }
}
